# Pandas Groupby

In [1]:
# Dataframe groupby example

import pandas as pd
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie','Alice', 'Charlie', 'David','Bob', 'Charlie','David'],'subject1:': [85, 78, 84, 96, 88, 92, 70, 95, 88],'subject2:': [89, 82, 81, 94, 90, 93, 72, 96, 90]})

df

      name  subject1:  subject2:
0    Alice         85         89
1      Bob         78         82
2  Charlie         84         81
3    Alice         96         94
4  Charlie         88         90
5    David         92         93
6      Bob         70         72
7  Charlie         95         96
8    David         88         90

In [3]:
group = df.groupby('name')
group

In [7]:
for name, group_df in group:
    print(name)
    print(group_df)
    print(type(group_df))
    print()
    print()

Alice
    name  subject1:  subject2:
0  Alice         85         89
3  Alice         96         94
<class 'pandas.core.frame.DataFrame'>


Bob
  name  subject1:  subject2:
1  Bob         78         82
6  Bob         70         72
<class 'pandas.core.frame.DataFrame'>


Charlie
      name  subject1:  subject2:
2  Charlie         84         81
4  Charlie         88         90
7  Charlie         95         96
<class 'pandas.core.frame.DataFrame'>


David
    name  subject1:  subject2:
5  David         92         93
8  David         88         90
<class 'pandas.core.frame.DataFrame'>

In [9]:
group.get_group('Alice')

    name  subject1:  subject2:
0  Alice         85         89
3  Alice         96         94

In [10]:
group.min()

         subject1:  subject2:
name
Alice           85         89
Bob             70         72
Charlie         84         81
David           88         90

In [11]:
group.max()

         subject1:  subject2:
name
Alice           96         94
Bob             78         82
Charlie         95         96
David           92         93

In [12]:
group.mean()

         subject1:  subject2:
name
Alice         90.5       91.5
Bob           74.0       77.0
Charlie       89.0       89.0
David         90.0       91.5

In [14]:
li = list(group) # convert groupby object to list   
li

[('Alice',
      name  subject1:  subject2:
  0  Alice         85         89
  3  Alice         96         94),
 ('Bob',
    name  subject1:  subject2:
  1  Bob         78         82
  6  Bob         70         72),
 ('Charlie',
        name  subject1:  subject2:
  2  Charlie         84         81
  4  Charlie         88         90
  7  Charlie         95         96),
 ('David',
      name  subject1:  subject2:
  5  David         92         93
  8  David         88         90)]